martin-ger/esp32_PPPoE_router/components/cmd_router/cmd_router.c
        char* web_lock = NULL;
        get_config_param_str("web_disabled", &web_lock);
        bool web_enabled = (web_lock == NULL || strcmp(web_lock, "0") == 0);
        int web_port = 80;
        get_config_param_int("web_port", &web_port);
        printf("\nWeb Interface: %s (port %d)\n", web_enabled ? "enabled" : "disabled", web_port);
        if (web_lock != NULL) free(web_lock);

        int wan_access = 0;
        get_config_param_int("wan_access", &wan_access);
        printf("  WAN access is %s\n", wan_access ? "ENABLED!" : "disabled");

        int8_t tx_power = 0;
        if (esp_wifi_get_max_tx_power(&tx_power) == ESP_OK) {
            printf("\nTX Power: %.1f dBm\n", tx_power * 0.25);
        }

        // Cleanup
        if (static_ip != NULL) free(static_ip);
        if (subnet_mask != NULL) free(subnet_mask);
        if (gateway_addr != NULL) free(gateway_addr);
        if (ap_ssid != NULL) free(ap_ssid);
        if (ap_passwd != NULL) free(ap_passwd);
        
    } else if (strcmp(type, "mappings") == 0) {
        // Show mappings
        printf("Network Mappings:\n");
        printf("=================\n");

        printf("\nDHCP Pool:\n");
        print_dhcp_pool();

        printf("\nDHCP Reservations:\n");
        print_dhcp_reservations();

        printf("\nPort Mappings:\n");
        print_portmap_tab();

    } else if (strcmp(type, "acl") == 0) {
        // Show ACL rules with device names
        printf("Firewall ACL Rules:\n");
        printf("===================\n");

        for (int i = 0; i < MAX_ACL_LISTS; i++) {
            acl_print_with_names(i);
        }

    } else if (strcmp(type, "pppoe") == 0) {
        printf("PPPoE DSL:\n");
        printf("==========\n");
        printf("Enabled: %s\n", pppoe_enabled ? "yes" : "no");
        if (pppoe_enabled) {
            const char *state;
            if (pppoe_is_connected()) {
                state = "connected";
            } else if (pppoe_connected) {
                state = "negotiating";
            } else {
                state = "disconnected";
            }
            printf("Status: %s\n", state);
        } else {
            printf("Status: disabled\n");
        }
        printf("Username: %s\n", (pppoe_user && pppoe_user[0]) ? pppoe_user : "<not set>");
        printf("Service: %s\n", (pppoe_service && pppoe_service[0]) ? pppoe_service : "<any>");
        const char *auth_str[] = {"auto", "PAP", "CHAP"};
        printf("Auth Type: %s\n", (pppoe_auth >= 0 && pppoe_auth <= 2) ? auth_str[pppoe_auth] : "auto");
        printf("VLAN ID: %ld%s\n", (long)pppoe_vlan, pppoe_vlan == 0 ? " (none)" : "");
        printf("Baby-jumbo: %s\n", pppoe_babyjumbo ? "yes (MSS=1460, PMTU=1500)" : "no (MSS=1452, PMTU=1492)");
        if (pppoe_ip != 0) {
            ip4_addr_t addr;
            addr.addr = pppoe_ip;
            printf("IP: " IPSTR "\n", IP2STR(&addr));
        } else {
            printf("IP: <not assigned>\n");
        }
        printf("MSS Clamp: %u\n", ap_mss_clamp);
        printf("Path MTU: %u\n", ap_pmtu);

    } else if (strcmp(type, "vpn") == 0) {
        printf("WireGuard VPN:\n");
        printf("==============\n");
        printf("Enabled: %s\n", vpn_enabled ? "yes" : "no");
        if (vpn_enabled) {
            const char *state;
            if (vpn_is_connected()) {
                state = "peer up";
            } else if (vpn_connected) {
                state = "handshake pending";
            } else {
                state = "disconnected";
            }
            printf("Status: %s\n", state);
        } else {
            printf("Status: disabled\n");
        }
        printf("Tunnel IP: %s\n", (vpn_address && vpn_address[0]) ? vpn_address : "<not set>");
        printf("Netmask: %s\n", (vpn_netmask && vpn_netmask[0]) ? vpn_netmask : "255.255.255.0");
        printf("Endpoint: %s:%ld\n", (vpn_endpoint && vpn_endpoint[0]) ? vpn_endpoint : "<not set>", (long)vpn_port);
        printf("Keepalive: %ld sec\n", (long)vpn_keepalive);
        printf("Private Key: %s\n", (vpn_private_key && vpn_private_key[0]) ? "<set>" : "<not set>");
        printf("Public Key: %s\n", (vpn_public_key && vpn_public_key[0]) ? vpn_public_key : "<not set>");
        printf("Preshared Key: %s\n", (vpn_preshared_key && vpn_preshared_key[0]) ? "<set>" : "<not set>");
        printf("MSS Clamp: %u\n", ap_mss_clamp);
        printf("Path MTU: %u\n", ap_pmtu);
        printf("Kill Switch: %s\n", vpn_killswitch ? "on" : "off");
        printf("Route All: %s\n", vpn_route_all ? "yes (all traffic)" : "no (split tunnel)");

    } else if (strcmp(type, "ota") == 0) {
        const esp_partition_t *running = esp_ota_get_running_partition();
        const esp_app_desc_t *app_desc = esp_app_get_description();
        const esp_partition_t *next = esp_ota_get_next_update_partition(NULL);
        const esp_partition_t *last = esp_ota_get_last_invalid_partition();

        printf("Running partition: %s (0x%lx, %luK)\n",
            running ? running->label : "unknown",
            running ? (unsigned long)running->address : 0,
            running ? (unsigned long)running->size / 1024 : 0);
        printf("Firmware version: %s\n", app_desc ? app_desc->version : "unknown");
        printf("Built: %s %s\n",
            app_desc ? app_desc->date : "unknown",
            app_desc ? app_desc->time : "");
        printf("IDF version: %s\n", app_desc ? app_desc->idf_ver : "unknown");
        printf("Next OTA partition: %s (0x%lx, %luK)\n",
            next ? next->label : "none",
            next ? (unsigned long)next->address : 0,
            next ? (unsigned long)next->size / 1024 : 0);

        if (last) {
            printf("Last invalid partition: %s\n", last->label);
        }

        esp_ota_img_states_t ota_state;
        if (running && esp_ota_get_state_partition(running, &ota_state) == ESP_OK) {
            const char *state_str = "unknown";
            switch (ota_state) {
                case ESP_OTA_IMG_NEW:             state_str = "new (first boot pending)"; break;
                case ESP_OTA_IMG_PENDING_VERIFY:  state_str = "pending verify"; break;
                case ESP_OTA_IMG_VALID:           state_str = "valid"; break;
                case ESP_OTA_IMG_INVALID:         state_str = "invalid"; break;
                case ESP_OTA_IMG_ABORTED:         state_str = "aborted"; break;
                default: break;
            }
            printf("Image state: %s\n", state_str);
        }

    } else {
        printf("Invalid parameter. Use: show <status|config|mappings|acl|pppoe|ota>\n");
        return 1;
    }

