martin-ger/esp32_PPPoE_router/components/cmd_router/cmd_router.c
    // Parse argument
    char *endptr;
    long ttl_val = strtol(argv[1], &endptr, 10);
    if (*endptr != '\0' || ttl_val < 0 || ttl_val > 255) {
        printf("Invalid TTL value. Use 0-255 (0 = disabled).\n");
        return 1;
    }

    err = set_config_param_int("sta_ttl", (int32_t)ttl_val);
    if (err == ESP_OK) {
        sta_ttl_override = (uint8_t)ttl_val;
        if (ttl_val == 0) {
            ESP_LOGI(TAG, "TTL override disabled.");
            printf("TTL override disabled (no change to packets).\n");
        } else {
            ESP_LOGI(TAG, "TTL override set to %ld.", ttl_val);
            printf("TTL override set to %ld for upstream packets.\n", ttl_val);
        }
    } else {
        printf("Failed to save setting\n");
    }
    return err;
}

static void register_set_ttl(void)
{
    const esp_console_cmd_t cmd = {
        .command = "set_ttl",
        .help = "Set TTL override for upstream STA packets (0 = disabled)",
        .hint = NULL,
        .func = &set_ttl_cmd,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

/* 'client_stats' command - enable/disable per-client traffic statistics */
static int client_stats_cmd(int argc, char **argv)
{
    if (argc < 2) {
        printf("Per-client stats: %s\n", client_stats_enabled ? "enabled" : "disabled");
        printf("Usage: client_stats <enable|disable>\n");
        return 0;
    }

    bool enable;
    if (strcmp(argv[1], "enable") == 0) {
        enable = true;
    } else if (strcmp(argv[1], "disable") == 0) {
        enable = false;
    } else {
        printf("Usage: client_stats <enable|disable>\n");
        return 1;
    }

    esp_err_t err = set_config_param_int("cstats_en", enable ? 1 : 0);
    if (err != ESP_OK) {
        printf("Failed to save setting\n");
        return 1;
    }
    client_stats_enabled = enable;
    printf("Per-client stats %s.\n", enable ? "enabled" : "disabled");
    return 0;
}

static void register_client_stats_cmd(void)
{
    const esp_console_cmd_t cmd = {
        .command = "client_stats",
        .help = "Enable or disable per-client traffic statistics",
        .hint = NULL,
        .func = &client_stats_cmd,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

/* 'set_ap_nat' command - enable or disable NAT on the AP interface */
static int set_ap_nat_cmd(int argc, char **argv)
{
    if (argc < 2) {
        printf("NAT: %s\n", ap_nat_enabled ? "enabled" : "disabled (routed mode)");
        printf("Usage: set_ap_nat <on|off>  (requires restart)\n");
        return 0;
    }
    const char *mode = argv[1];
    int val;
    if (strcasecmp(mode, "on") == 0 || strcmp(mode, "1") == 0) {
        val = 1;
    } else if (strcasecmp(mode, "off") == 0 || strcmp(mode, "0") == 0) {
        val = 0;
    } else {
        printf("Usage: set_ap_nat <on|off>\n");
        return 1;
    }
    set_config_param_int("ap_nat", val);
    ap_nat_enabled = (uint8_t)val;
    printf("AP NAT %s. Restart to apply.\n", val ? "enabled" : "disabled (routed mode)");
    return 0;
}

static void register_set_ap_nat(void)
{
    const esp_console_cmd_t cmd = {
        .command = "set_ap_nat",
        .help = "Enable or disable NAT on the AP interface (default: on). Requires restart.",
        .hint = NULL,
        .func = &set_ap_nat_cmd,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

/* 'set_tx_power' command - set WiFi TX power */
static int set_tx_power_cmd(int argc, char **argv)
{
    int8_t current_power = 0;
    esp_err_t ret = esp_wifi_get_max_tx_power(&current_power);

    if (argc < 2) {
        printf("Usage: set_tx_power <dBm>\n");
        printf("  dBm: 2-20 (0 = max/default)\n");
        printf("  Actual steps: 2, 5, 7, 8, 11, 13, 14, 15, 16, 18, 20\n");
        if (ret == ESP_OK) {
            printf("\nCurrent TX power: %.1f dBm (raw: %d)\n", current_power * 0.25, current_power);
        }
        int saved = 0;
        get_config_param_int("tx_power", &saved);
        if (saved > 0) {
            printf("Saved setting: %d dBm\n", saved);
        } else {
            printf("Saved setting: max (default)\n");
        }
        return 0;
    }

    char *endptr;
    long dbm = strtol(argv[1], &endptr, 10);
    if (*endptr != '\0' || (dbm != 0 && (dbm < 2 || dbm > 20))) {
        printf("Invalid value. Use 2-20 dBm (0 = max/default).\n");
        return 1;
    }

    esp_err_t err = set_config_param_int("tx_power", (int32_t)dbm);

    if (err != ESP_OK) {
        printf("Failed to save setting\n");
        return err;
    }

    if (dbm == 0) {
        printf("TX power set to max (default). Restart to apply.\n");
    } else {
        int8_t power_qdbm = (int8_t)(dbm * 4);
        ret = esp_wifi_set_max_tx_power(power_qdbm);
        if (ret == ESP_OK) {
            esp_wifi_get_max_tx_power(&current_power);
            printf("TX power set to %.1f dBm (applied immediately, saved for reboot).\n", current_power * 0.25);
        } else {
            printf("Saved for next reboot. Could not apply now: %s\n", esp_err_to_name(ret));
        }
    }
    return 0;
}

static void register_set_tx_power(void)
{
    const esp_console_cmd_t cmd = {
        .command = "set_tx_power",
        .help = "Set WiFi TX power in dBm (2-20, 0 = max/default)",
        .hint = NULL,
        .func = &set_tx_power_cmd,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

#if defined(CONFIG_IDF_TARGET_ESP32C6)
/* 'set_rf_switch_XIAO' command - XIAO ESP32-C6 antenna selection */
static int set_rf_switch_cmd(int argc, char **argv)
{
    if (argc < 2) {
        int current = 0;
        get_config_param_int("rf_switch", &current);
        printf("XIAO ESP32-C6 RF switch: %s\n", current ? "external antenna" : "built-in antenna (default)");
        printf("Usage: set_rf_switch_XIAO <0|1>\n");
        printf("  0 = built-in ceramic antenna (default)\n");
        printf("  1 = external antenna\n");
        return 0;
    }

    int value;
    if (strcmp(argv[1], "1") == 0) {
        value = 1;
    } else if (strcmp(argv[1], "0") == 0) {
        value = 0;
    } else {
        printf("Invalid value. Use 0 (built-in) or 1 (external).\n");
        return 1;
    }

    esp_err_t err = set_config_param_int("rf_switch", value);
    if (err == ESP_OK) {
        // Apply immediately
        gpio_reset_pin(GPIO_NUM_3);
        gpio_set_direction(GPIO_NUM_3, GPIO_MODE_OUTPUT);
        gpio_set_level(GPIO_NUM_3, 0);  // Activate RF switch control
        vTaskDelay(pdMS_TO_TICKS(10));
        gpio_reset_pin(GPIO_NUM_14);
        gpio_set_direction(GPIO_NUM_14, GPIO_MODE_OUTPUT);
        gpio_set_level(GPIO_NUM_14, value); // 0 = built-in, 1 = external

        if (value) {
            printf("Switched to external antenna.\n");
        } else {
            printf("Switched to built-in ceramic antenna.\n");
        }
        printf("Setting saved (persists across reboots).\n");
    } else {
        printf("Failed to save setting\n");
    }
    return err;
}

static void register_set_rf_switch(void)
{
    const esp_console_cmd_t cmd = {
        .command = "set_rf_switch_XIAO",
        .help = "XIAO ESP32-C6: switch between built-in (0) and external (1) antenna",
        .hint = NULL,
        .func = &set_rf_switch_cmd,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}
#endif

