martin-ger/esp32_PPPoE_router/components/cmd_router/cmd_router.c
    if (set_vpn_args.privkey->count > 0) {
        nvs_set_str(nvs, "vpn_privkey", set_vpn_args.privkey->sval[0]);
    }
    if (set_vpn_args.pubkey->count > 0) {
        nvs_set_str(nvs, "vpn_pubkey", set_vpn_args.pubkey->sval[0]);
    }
    if (set_vpn_args.endpoint->count > 0) {
        nvs_set_str(nvs, "vpn_endpoint", set_vpn_args.endpoint->sval[0]);
    }
    if (set_vpn_args.address->count > 0) {
        nvs_set_str(nvs, "vpn_ip", set_vpn_args.address->sval[0]);
    }
    if (set_vpn_args.psk->count > 0) {
        nvs_set_str(nvs, "vpn_psk", set_vpn_args.psk->sval[0]);
    }
    if (set_vpn_args.mask->count > 0) {
        nvs_set_str(nvs, "vpn_mask", set_vpn_args.mask->sval[0]);
    }
    if (set_vpn_args.port->count > 0) {
        nvs_set_i32(nvs, "vpn_port", set_vpn_args.port->ival[0]);
    }
    if (set_vpn_args.keepalive->count > 0) {
        nvs_set_i32(nvs, "vpn_ka", set_vpn_args.keepalive->ival[0]);
    }
    if (set_vpn_args.enable->count > 0) {
        nvs_set_i32(nvs, "vpn_enabled", set_vpn_args.enable->ival[0]);
    }
    if (set_vpn_args.killswitch->count > 0) {
        nvs_set_i32(nvs, "vpn_ks", set_vpn_args.killswitch->ival[0]);
    }
    if (set_vpn_args.route_all->count > 0) {
        nvs_set_i32(nvs, "vpn_rall", set_vpn_args.route_all->ival[0]);
    }

    nvs_commit(nvs);
    nvs_close(nvs);
    printf("VPN settings saved. Restart to apply.\n");
    return 0;
}

static void register_set_vpn(void)
{
    set_vpn_args.privkey   = arg_str0(NULL, NULL, "<private_key>", "WireGuard private key (base64)");
    set_vpn_args.pubkey    = arg_str0(NULL, NULL, "<public_key>", "Peer public key (base64)");
    set_vpn_args.endpoint  = arg_str0(NULL, NULL, "<endpoint>", "Peer endpoint host/IP");
    set_vpn_args.address   = arg_str0(NULL, NULL, "<address>", "Tunnel IP (e.g. 10.0.0.2)");
    set_vpn_args.psk       = arg_str0("k", "psk", "<preshared_key>", "Preshared key (base64)");
    set_vpn_args.mask      = arg_str0("m", "mask", "<netmask>", "Tunnel netmask (default 255.255.255.0)");
    set_vpn_args.port      = arg_int0("p", "port", "<port>", "Peer UDP port (default 51820)");
    set_vpn_args.keepalive = arg_int0("a", "keepalive", "<seconds>", "Persistent keepalive (0=disabled)");
    set_vpn_args.enable    = arg_int0("e", "enable", "<0|1>", "Enable/disable VPN");
    set_vpn_args.killswitch = arg_int0("K", "killswitch", "<0|1>", "Kill switch: block internet when VPN down (default on)");
    set_vpn_args.route_all = arg_int0("R", "route-all", "<0|1>", "Route all traffic through VPN (0=split tunnel)");
    set_vpn_args.end       = arg_end(4);

    const esp_console_cmd_t cmd = {
        .command = "set_vpn",
        .help = "Configure WireGuard VPN (restart to apply)",
        .hint = NULL,
        .func = &set_vpn_cmd,
        .argtable = &set_vpn_args
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

static void register_set_pppoe(void)
{
    set_pppoe_args.user       = arg_str0("u", "user", "<username>", "ISP username");
    set_pppoe_args.pass       = arg_str0("p", "pass", "<password>", "ISP password");
    set_pppoe_args.service    = arg_str0("s", "service", "<name>", "Service name (optional)");
    set_pppoe_args.auth       = arg_int0("a", "auth", "<0|1|2>", "Auth type: 0=auto, 1=PAP, 2=CHAP");
    set_pppoe_args.enable     = arg_int0("e", "enable", "<0|1>", "Enable/disable PPPoE");
    set_pppoe_args.vlan       = arg_int0("v", "vlan", "<id>", "802.1Q VLAN ID (0=disabled)");
    set_pppoe_args.babyjumbo  = arg_int0("j", "babyjumbo", "<0|1>", "Baby-jumbo frames: 1=1508-byte payload/MSS=1460 (default), 0=standard/MSS=1452");
    set_pppoe_args.end        = arg_end(4);

    const esp_console_cmd_t cmd = {
        .command = "set_pppoe",
        .help = "Configure PPPoE DSL uplink (restart to apply)",
        .hint = NULL,
        .func = &set_pppoe_cmd,
        .argtable = &set_pppoe_args
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

#if CONFIG_DDNS_ENABLED
/* ============== DDNS CLI commands ============================= */

static struct {
    struct arg_str *action;
    struct arg_str *arg1;
    struct arg_str *arg2;
    struct arg_int *enable;
    struct arg_int *poll;
    struct arg_end *end;
} ddns_args;

static int ddns_cmd(int argc, char **argv)
{
    int nerrors = arg_parse(argc, argv, (void **)&ddns_args);
    if (nerrors != 0) {
        arg_print_errors(stderr, ddns_args.end, argv[0]);
        return 1;
    }

    if (ddns_args.action->count == 0) {
        printf("Usage: ddns <action> [args]\n");
        printf("Actions:\n");
        printf("  status              — Show current DDNS config and status\n");
        printf("  enable <0|1>        — Toggle DDNS\n");
        printf("  provider <0|1|2>    — Select provider: 0=NoIP, 1=DuckDNS, 2=Selfhost.de\n");
        printf("  hostname <fqdn>     — Set hostname (or subdomain for DuckDNS)\n");
        printf("  token <token>       — Set token (DuckDNS/Selfhost) or username (NoIP)\n");
        printf("  password <pw>       — Set password (NoIP only)\n");
        printf("  poll <hours>        — Set keep-alive interval (1-168 hours)\n");
        printf("  update              — Trigger immediate update\n");
        return 0;
    }

    const char *action = ddns_args.action->sval[0];

    if (strcmp(action, "status") == 0) {
        char buf[512];
        ddns_get_status(buf, sizeof(buf));
        printf("%s\n", buf);
        return 0;
    }

    if (strcmp(action, "enable") == 0) {
        if (ddns_args.enable->count == 0) {
            printf("Usage: ddns enable <0|1>\n");
            return 1;
        }
        int val = ddns_args.enable->ival[0];
        if (val < 0 || val > 1) {
            printf("Error: value must be 0 or 1\n");
            return 1;
        }
        nvs_handle_t h;
        nvs_open(PARAM_NAMESPACE, NVS_READWRITE, &h);
        nvs_set_i32(h, "ddns_en", val);
        nvs_commit(h);
        nvs_close(h);
        printf("DDNS %s\n", val ? "enabled" : "disabled");
        return 0;
    }

