martin-ger/esp32_PPPoE_router/components/cmd_router/cmd_router.c
    if (strcmp(action, "provider") == 0) {
        if (ddns_args.arg1->count == 0) {
            printf("Usage: ddns provider <0|1|2|3|4>\n");
            printf("  0 = NoIP\n");
            printf("  1 = DuckDNS\n");
            printf("  2 = Selfhost.de\n");
            printf("  3 = Dynu\n");
            printf("  4 = Namecheap\n");
            return 1;
        }
        int prov = atoi(ddns_args.arg1->sval[0]);
        if (prov < 0 || prov > 4) {
            printf("Error: provider must be 0, 1, or 2\n");
            return 1;
        }
        nvs_handle_t h;
        nvs_open(PARAM_NAMESPACE, NVS_READWRITE, &h);
        nvs_set_u8(h, "ddns_prov", (uint8_t)prov);
        nvs_commit(h);
        nvs_close(h);
        printf("DDNS provider set to: %s\n", ddns_get_provider_name(prov));
        return 0;
    }

    if (strcmp(action, "hostname") == 0) {
        if (ddns_args.arg1->count == 0) {
            printf("Usage: ddns hostname <fqdn>\n");
            return 1;
        }
        /* For DuckDNS, the hostname field stores the subdomain */
        if (ddns_args.arg1->sval[0][0] == '\0') {
            printf("Error: hostname cannot be empty\n");
            return 1;
        }
        nvs_handle_t h;
        nvs_open(PARAM_NAMESPACE, NVS_READWRITE, &h);
        nvs_set_str(h, "ddns_host", ddns_args.arg1->sval[0]);
        nvs_commit(h);
        nvs_close(h);
        printf("DDNS hostname set: %s\n", ddns_args.arg1->sval[0]);
        return 0;
    }

    if (strcmp(action, "token") == 0) {
        if (ddns_args.arg1->count == 0) {
            printf("Usage: ddns token <token>\n");
            return 1;
        }
        uint8_t prov = 0;
        nvs_handle_t h;
        nvs_open(PARAM_NAMESPACE, NVS_READONLY, &h);
        nvs_get_u8(h, "ddns_prov", &prov);
        nvs_close(h);
        
        if (prov == DDNS_PROVIDER_NOIP) {
            /* For NoIP, token field stores username */
            nvs_open(PARAM_NAMESPACE, NVS_READWRITE, &h);
            nvs_set_str(h, "ddns_token", ddns_args.arg1->sval[0]);
            nvs_commit(h);
            nvs_close(h);
            printf("DDNS username set: %s\n", ddns_args.arg1->sval[0]);
        } else {
            /* For DuckDNS/Selfhost, token is the API token */
            nvs_open(PARAM_NAMESPACE, NVS_READWRITE, &h);
            nvs_set_str(h, "ddns_token", ddns_args.arg1->sval[0]);
            nvs_commit(h);
            nvs_close(h);
            printf("DDNS token set\n");
        }
        return 0;
    }

    if (strcmp(action, "password") == 0) {
        if (ddns_args.arg1->count == 0) {
            printf("Usage: ddns password <pw>\n");
            return 1;
        }
        nvs_handle_t h;
        nvs_open(PARAM_NAMESPACE, NVS_READWRITE, &h);
        nvs_set_str(h, "ddns_pass", ddns_args.arg1->sval[0]);
        nvs_commit(h);
        nvs_close(h);
        printf("DDNS password set\n");
        return 0;
    }

    if (strcmp(action, "poll") == 0) {
        if (ddns_args.arg1->count == 0) {
            printf("Usage: ddns poll <hours>\n");
            return 1;
        }
        int hours = atoi(ddns_args.arg1->sval[0]);
        if (hours < 1 || hours > 168) {
            printf("Error: interval must be between 1 and 168 hours\n");
            return 1;
        }
        nvs_handle_t h;
        nvs_open(PARAM_NAMESPACE, NVS_READWRITE, &h);
        nvs_set_i32(h, "ddns_poll", hours * 3600);
        nvs_commit(h);
        nvs_close(h);
        printf("DDNS keep-alive interval set to: %d hours\n", hours);
        return 0;
    }

    if (strcmp(action, "update") == 0) {
        if (pppoe_ip == 0) {
            printf("Error: no WAN IP available\n");
            return 1;
        }
        printf("Triggering DDNS update...\n");
        ddns_trigger_update(DDNS_TRIGGER_MANUAL);
        return 0;
    }

    return 0;
}

static void register_ddns_cmd(void)
{
    ddns_args.action = arg_str1(NULL, NULL, "<action>", NULL);
    ddns_args.arg1   = arg_str0(NULL, NULL, "<arg1>", NULL);
    ddns_args.arg2   = arg_str0(NULL, NULL, "<arg2>", NULL);
    ddns_args.enable = arg_int0("e", "enable", "<0|1>", "Enable/disable DDNS");
    ddns_args.poll   = arg_int0("p", "poll", "<seconds>", "Poll interval");
    ddns_args.end    = arg_end(3);

    const esp_console_cmd_t cmd = {
        .command = "ddns",
        .help = "Dynamic DNS client (NoIP, DuckDNS, Selfhost.de)",
        .hint = NULL,
        .func = &ddns_cmd,
        .argtable = &ddns_args
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}
#endif
